app/Controllers/BahanBakuController.php

SELECT *
FROM `BahanBaku`
---
    public function databahanbaku()
    {
        $modalBahanBaku = new ModalBahanBaku();

        $data = [
            'bahanbaku' => $modalBahanBaku->findAll()
        ];

INSERT INTO `BahanBaku` (`IdBahanBaku`, `NamaBahan`, `Satuan`, `Stok`, `Harga`, `Merk`) VALUES ('BBK000010', ' Choco Chip', 'kg', '2', '100000', '-')
---
            'Merk'        => $this->request->getPost('Merk')
        ];

        $modalBahanBaku->insert($data);