app/Controllers/LaporanController.php

SELECT *
FROM `User`
WHERE `Status` = 'Aktif'
---
    public function cetakuser()
    {
        $model = new \App\Models\ModalUser();


        // Ambil parameter status dari URL
        $status = $this->request->getGet('status');

        // Filter data berdasarkan status
        if ($status == 'Aktif') {

            $user = $model->where('Status', 'Aktif')->findAll();

SELECT `Pelanggan`.*, `USER`.`Email`, `USER`.`Status`
FROM `Pelanggan`
JOIN `USER` ON `USER`.`IdUser` = `Pelanggan`.`IdUser`
---
    public function laporanpelanggan()
    {
        $db = \Config\Database::connect();

        $user = $db->table('Pelanggan')
            ->select('Pelanggan.*, USER.Email, USER.Status')
            ->join('USER', 'USER.IdUser = Pelanggan.IdUser')
            ->get()
            ->getResultArray();

SELECT `Pelanggan`.*, `USER`.`Email`, `USER`.`Status`
FROM `Pelanggan`
JOIN `USER` ON `USER`.`IdUser` = `Pelanggan`.`IdUser`
---
    public function cetakpelanggan()
    {
        $db = \Config\Database::connect();

        $status = $this->request->getGet('status');

        $builder = $db->table('Pelanggan');
        $builder->select('Pelanggan.*, USER.Email, USER.Status');
        $builder->join('USER', 'USER.IdUser = Pelanggan.IdUser');

        if ($status == 'Aktif') {

            $builder->where('USER.Status', 'Aktif');
            $judul = 'Laporan Data Pelanggan Aktif';
        } elseif ($status == 'Nonaktif') {

            $builder->where('USER.Status', 'Nonaktif');
            $judul = 'Laporan Data Pelanggan Nonaktif';
        } else {

            $judul = 'Laporan Data Pelanggan';
        }

        $data = [
            'pelanggan' => $builder->get()->getResultArray(),
            'judul'     => $judul,
            'status'    => $status
        ];

SELECT *
FROM `Produk`
---
    public function laporanproduk()
    {
        $model = new \App\Models\ModalProduk();

        $data = [
            'produk' => $model->findAll()
        ];

SELECT *
FROM `Produk`
---
    public function cetakproduk()
    {
        $model = new \App\Models\ModalProduk();

        $status = $this->request->getGet('status');

        if ($status == 'Aktif') {

            $produk = $model->where('StatusProduk', 'Aktif')->findAll();

            $judul = 'Laporan Data Produk Aktif';
        } elseif ($status == 'Nonaktif') {

            $produk = $model->where('StatusProduk', 'Nonaktif')->findAll();

            $judul = 'Laporan Data Produk Nonaktif';
        } else {

            $produk = $model->findAll();

SELECT `Kemasan`.*, `Produk`.`NamaProduk`
FROM `Kemasan`
JOIN `Produk` ON `Produk`.`IdProduk` = `Kemasan`.`IdProduk`
---
    public function laporankemasan()
    {
        $db = \Config\Database::connect();

        $kemasan = $db->table('Kemasan')
            ->select('Kemasan.*, Produk.NamaProduk')
            ->join('Produk', 'Produk.IdProduk = Kemasan.IdProduk')
            ->get()
            ->getResultArray();

SELECT `Kemasan`.*, `Produk`.`NamaProduk`
FROM `Kemasan`
JOIN `Produk` ON `Produk`.`IdProduk` = `Kemasan`.`IdProduk`
---
    public function cetakkemasan()
    {
        $db = \Config\Database::connect();

        $status = $this->request->getGet('status');

        $builder = $db->table('Kemasan');
        $builder->select('Kemasan.*, Produk.NamaProduk');
        $builder->join('Produk', 'Produk.IdProduk = Kemasan.IdProduk');

        if ($status == 'Aktif') {

            $builder->where('Kemasan.StatusKemasan', 'Aktif');

            $judul = 'Laporan Data Kemasan Aktif';
        } elseif ($status == 'Nonaktif') {

            $builder->where('Kemasan.StatusKemasan', 'Nonaktif');

            $judul = 'Laporan Data Kemasan Nonaktif';
        } else {

            $judul = 'Laporan Data Kemasan';
        }

        $data = [
            'kemasan' => $builder->get()->getResultArray(),
            'judul'   => $judul,
            'status'  => $status
        ];

SELECT *
FROM `BahanBaku`
---
    public function laporanbahanbaku()
    {
        $model = new \App\Models\ModalBahanBaku();

        $data = [
            'bahanbaku' => $model->findAll()
        ];

SELECT *
FROM `BahanBaku`
---
    public function cetakbahanbaku()
    {
        $model = new \App\Models\ModalBahanBaku();

        $bahanbaku = $model->findAll();

SELECT `Produksi`.*, `Produk`.`NamaProduk`
FROM `Produksi`
JOIN `Produk` ON `Produk`.`IdProduk` = `Produksi`.`IdProduk`
---
    public function laporanproduksi()
    {
        $db = \Config\Database::connect();

        $produksi = $db->table('Produksi')
            ->select('Produksi.*, Produk.NamaProduk')
            ->join('Produk', 'Produk.IdProduk = Produksi.IdProduk')
            ->get()
            ->getResultArray();

SELECT `Pesanan`.*, `Pelanggan`.`NamaPelanggan`
FROM `Pesanan`
JOIN `Pelanggan` ON `Pelanggan`.`IdPelanggan` = `Pesanan`.`IdPelanggan`
---
    public function laporanpesanan()
    {
        $db = \Config\Database::connect();

        $pesanan = $db->table('Pesanan')
            ->select('Pesanan.*, Pelanggan.NamaPelanggan')
            ->join('Pelanggan', 'Pelanggan.IdPelanggan = Pesanan.IdPelanggan')
            ->get()
            ->getResultArray();

SELECT `Pembayaran`.*, `Pesanan`.`IdPesanan`, `Pesanan`.`TglPesanan`, `Pesanan`.`Total`, `Pelanggan`.`NamaPelanggan`
FROM `Pembayaran`
JOIN `Pesanan` ON `Pesanan`.`IdPesanan` = `Pembayaran`.`IdPesanan`
JOIN `Pelanggan` ON `Pelanggan`.`IdPelanggan` = `Pesanan`.`IdPelanggan`
WHERE `Pembayaran`.`StatusPembayaran` = 'Terverifikasi'
---
    public function laporanpenjualan()
    {
        $db = \Config\Database::connect();

        $penjualan = $db->table('Pembayaran')
            ->select('
            Pembayaran.*,
            Pesanan.IdPesanan,
            Pesanan.TglPesanan,
            Pesanan.Total,
            Pelanggan.NamaPelanggan
        ')
            ->join('Pesanan', 'Pesanan.IdPesanan = Pembayaran.IdPesanan')
            ->join('Pelanggan', 'Pelanggan.IdPelanggan = Pesanan.IdPelanggan')
            ->where('Pembayaran.StatusPembayaran', 'Terverifikasi')
            ->get()
            ->getResultArray();

SELECT `Pembayaran`.*, `Pesanan`.`IdPesanan`, `Pesanan`.`TglPesanan`, `Pesanan`.`Total`, `Pelanggan`.`NamaPelanggan`
FROM `Pembayaran`
JOIN `Pesanan` ON `Pesanan`.`IdPesanan` = `Pembayaran`.`IdPesanan`
JOIN `Pelanggan` ON `Pelanggan`.`IdPelanggan` = `Pesanan`.`IdPelanggan`
WHERE `Pembayaran`.`StatusPembayaran` = 'Terverifikasi'
---
    public function cetakpenjualan()
    {
        $db = \Config\Database::connect();

        $tglAwal  = $this->request->getGet('tgl_awal');
        $tglAkhir = $this->request->getGet('tgl_akhir');

        $builder = $db->table('Pembayaran');

        $builder->select('
        Pembayaran.*,
        Pesanan.IdPesanan,
        Pesanan.TglPesanan,
        Pesanan.Total,
        Pelanggan.NamaPelanggan
    ');

        $builder->join('Pesanan', 'Pesanan.IdPesanan = Pembayaran.IdPesanan');
        $builder->join('Pelanggan', 'Pelanggan.IdPelanggan = Pesanan.IdPelanggan');

        // Hanya transaksi yang sudah berhasil
        $builder->where('Pembayaran.StatusPembayaran', 'Terverifikasi');

        if (!empty($tglAwal) && !empty($tglAkhir)) {

            $builder->where('Pembayaran.TglBayar >=', $tglAwal);
            $builder->where('Pembayaran.TglBayar <=', $tglAkhir);
        }

        $data = [
            'penjualan' => $builder->get()->getResultArray(),
            'judul'     => 'Laporan Penjualan',
            'tglAwal'   => $tglAwal,
            'tglAkhir'  => $tglAkhir
        ];

SELECT `DetailProduksi`.*, `Produksi`.`IdProduksi`, `Produksi`.`TglProduksi`, `BahanBaku`.`NamaBahan`
FROM `DetailProduksi`
JOIN `Produksi` ON `Produksi`.`IdProduksi` = `DetailProduksi`.`IdProduksi`
JOIN `BahanBaku` ON `BahanBaku`.`IdBahanBaku` = `DetailProduksi`.`IdBahanBaku`
ORDER BY `Produksi`.`TglProduksi` DESC
---
    public function pemakaianbahanbaku()
    {
        $db = \Config\Database::connect();

        $pemakaian = $db->table('DetailProduksi')
            ->select('
            DetailProduksi.*,
            Produksi.IdProduksi,
            Produksi.TglProduksi,
            BahanBaku.NamaBahan
        ')
            ->join('Produksi', 'Produksi.IdProduksi = DetailProduksi.IdProduksi')
            ->join('BahanBaku', 'BahanBaku.IdBahanBaku = DetailProduksi.IdBahanBaku')
            ->orderBy('Produksi.TglProduksi', 'DESC')
            ->get()
            ->getResultArray();

SELECT `IdPesanan`
FROM `Pesanan`
ORDER BY `IdPesanan` ASC
---
    public function fakturpembayaran()
    {
        $db = \Config\Database::connect();

        $pesanan = $db->table('Pesanan')
            ->select('IdPesanan')
            ->orderBy('IdPesanan', 'ASC')
            ->get()
            ->getResultArray();

SELECT `Pembayaran`.*, `Pesanan`.`IdPesanan`, `Pesanan`.`TglPesanan`, `Pesanan`.`Total`, `Pelanggan`.`NamaPelanggan`, `Pelanggan`.`NoHp`, `Pelanggan`.`Alamat`
FROM `Pembayaran`
JOIN `Pesanan` ON `Pesanan`.`IdPesanan` = `Pembayaran`.`IdPesanan`
JOIN `Pelanggan` ON `Pelanggan`.`IdPelanggan` = `Pesanan`.`IdPelanggan`
WHERE `Pesanan`.`IdPesanan` = 'PSN000002'
SELECT `DetailPesanan`.*, `Kemasan`.`NamaKemasan`, `Produk`.`NamaProduk`
FROM `DetailPesanan`
JOIN `Kemasan` ON `Kemasan`.`IdKemasan` = `DetailPesanan`.`IdKemasan`
JOIN `Produk` ON `Produk`.`IdProduk` = `Kemasan`.`IdProduk`
WHERE `DetailPesanan`.`IdPesanan` = 'PSN000002'
---
    public function cetakfaktur()
    {
        $db = \Config\Database::connect();

        $idPesanan = $this->request->getPost('idpesanan');

        // ================= HEADER FAKTUR =================
        $faktur = $db->table('Pembayaran')
            ->select('
            Pembayaran.*,
            Pesanan.IdPesanan,
            Pesanan.TglPesanan,
            Pesanan.Total,
            Pelanggan.NamaPelanggan,
            Pelanggan.NoHp,
            Pelanggan.Alamat
        ')
            ->join('Pesanan', 'Pesanan.IdPesanan = Pembayaran.IdPesanan')
            ->join('Pelanggan', 'Pelanggan.IdPelanggan = Pesanan.IdPelanggan')
            ->where('Pesanan.IdPesanan', $idPesanan)
            ->get()
            ->getRowArray();

        // ================= DETAIL PESANAN =================
        $detail = $db->table('DetailPesanan')
            ->select('
            DetailPesanan.*,
            Kemasan.NamaKemasan,
            Produk.NamaProduk
        ')
            ->join('Kemasan', 'Kemasan.IdKemasan = DetailPesanan.IdKemasan')
            ->join('Produk', 'Produk.IdProduk = Kemasan.IdProduk')
            ->where('DetailPesanan.IdPesanan', $idPesanan)
            ->get()
            ->getResultArray();