app/Controllers/PelangganController.php

    public function datapelanggan()
    {
        $model = new ModalPelanggan();

        $data = [
            'pelanggan' => $model->findAll()
        ];
---
SELECT *
FROM `Pelanggan`

    public function fakturPembayaran($idPesanan)
    {
        $modelPesanan = new ModalPesanan();
        $modelPelanggan = new ModalPelanggan();

        // pelanggan login
        $pelanggan = $modelPelanggan
            ->where('IdUser', session()->get('IdUser'))
            ->first();
---
SELECT *
FROM `Pelanggan`
WHERE `IdUser` = 'USR000002'
 LIMIT 1