app/Controllers/PembayaranController.php

SELECT *
FROM `Pesanan`
WHERE `Pesanan`.`IdPesanan` = 'PSN000006'
SELECT *
FROM `Pembayaran`
WHERE `IdPesanan` = 'PSN000006'
AND `StatusPembayaran` = 'Menunggu Verifikasi'
 LIMIT 1
---
    private function updateStatusPesanan($IdPesanan)
    {
        $modalPembayaran = new ModalPembayaran();
        $modalPesanan    = new ModalPesanan();

        $pesanan = $modalPesanan->find($IdPesanan);

        if (!$pesanan) return;

        $totalPesanan = (float) $pesanan['Total'];

        $totalTerverifikasi = $modalPembayaran->getTotalTerverifikasi($IdPesanan);

        // Cek apakah ada pembayaran yang masih menunggu
        $adaMenunggu = $modalPembayaran
            ->where('IdPesanan', $IdPesanan)
            ->where('StatusPembayaran', 'Menunggu Verifikasi')
            ->first();

UPDATE `Pesanan` SET `StatusPesanan` = 'Selesai'
WHERE `Pesanan`.`IdPesanan` IN ('PSN000006')
---
            $statusPesanan = 'Diproses';
        }

        $modalPesanan->update($IdPesanan, [
            'StatusPesanan' => $statusPesanan
        ]);

SELECT *
FROM `Pembayaran`
WHERE `Pembayaran`.`IdPembayaran` = 'BYR000006'
SELECT `Pesanan`.*, `Pelanggan`.`NamaPelanggan`
FROM `Pesanan`
JOIN `Pelanggan` ON `Pelanggan`.`IdPelanggan` = `Pesanan`.`IdPelanggan`
---
    public function edit($IdPembayaran)
    {
        $modalPembayaran = new ModalPembayaran();
        $modalPesanan    = new ModalPesanan();

        $pembayaran = $modalPembayaran->find($IdPembayaran);

        if (!$pembayaran) {

            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound(
                'Data pembayaran tidak ditemukan'
            );
        }

        $pesanan = $modalPesanan
            ->select('Pesanan.*, Pelanggan.NamaPelanggan')
            ->join('Pelanggan', 'Pelanggan.IdPelanggan = Pesanan.IdPelanggan')
            ->findAll();

SELECT *
FROM `Pembayaran`
WHERE `Pembayaran`.`IdPembayaran` = 'BYR000006'
---
    public function update()
    {
        $modalPembayaran = new ModalPembayaran();
        $db = \Config\Database::connect();

        $IdPembayaran = $this->request->getPost('IdPembayaran');

        // Ambil data lama
        $pembayaranLama = $modalPembayaran->find($IdPembayaran);

UPDATE `Pembayaran` SET `IdPesanan` = 'PSN000006', `TglBayar` = '2026-07-25', `JumlahBayar` = '75000.00', `JenisPembayaran` = 'Pelunasan', `StatusPembayaran` = 'Terverifikasi', `MetodePembayaran` = 'Transfer', `BuktiPembayaran` = '1784968820_f8101c53d77075a3a624.webp'
WHERE `Pembayaran`.`IdPembayaran` IN ('BYR000006')
---
        // ==========================
        $db->transStart();

        $modalPembayaran->update($IdPembayaran, [

            'IdPesanan'          => $this->request->getPost('IdPesanan'),
            'TglBayar'           => $this->request->getPost('TglBayar'),
            'JumlahBayar'        => $this->request->getPost('JumlahBayar'),
            'JenisPembayaran'    => $this->request->getPost('JenisPembayaran'),
            'StatusPembayaran'   => $this->request->getPost('StatusPembayaran'),
            'MetodePembayaran'   => $this->request->getPost('MetodePembayaran'),
            'BuktiPembayaran'    => $namaBukti

        ]);

SELECT *
FROM `Pembayaran`
WHERE `IdPesanan` = 'PSN000005'
 LIMIT 1
---
    public function bayar($IdPesanan)
    {
        $modelPesanan = new ModalPesanan();
        $modelPembayaran = new ModalPembayaran();

        $pesanan = $modelPesanan->getPesanan($IdPesanan);
        $detail = $modelPesanan->getDetailPesanan($IdPesanan);

        // Cek apakah sudah pernah bayar untuk pesanan ini
        $pembayaran = $modelPembayaran
            ->where('IdPesanan', $IdPesanan)
            ->first();

INSERT INTO `Pembayaran` (`IdPembayaran`, `IdPesanan`, `TglBayar`, `JenisPembayaran`, `MetodePembayaran`, `JumlahBayar`, `BuktiPembayaran`, `StatusPembayaran`) VALUES ('BYR000005', 'PSN000006', '2026-07-25', 'DP', 'Transfer', '75000', '1784968753_640520c14157a2d1cdd9.png', 'Menunggu Verifikasi')
---

        ];

        $modalPembayaran->insert($data);