app/Controllers/PesananController.php

SELECT *
FROM `Pelanggan`
WHERE `IdUser` = 'USR000002'
 LIMIT 1
---
    public function riwayatpesanan($status = 'Semua')
    {
        $modelPesanan   = new ModalPesanan();
        $modelPelanggan = new ModalPelanggan();

        // Ambil pelanggan dari session
        $pelanggan = $modelPelanggan
            ->where('IdUser', session()->get('IdUser'))
            ->first();