app/Controllers/ProdukController.php

    public function dataproduk()
    {
        $modalProduk = new ModalProduk();

        $data = [
            'produk' => $modalProduk->findAll()
        ];
---
SELECT *
FROM `Produk`

            'StatusProduk' => $this->request->getPost('StatusProduk')
        ];

        $modalProduk->insert($data);
---
INSERT INTO `Produk` (`IdProduk`, `NamaProduk`, `Deskripsi`, `StatusProduk`) VALUES ('PRD000005', 'Naimen', 'Kukis dengan bahan havermut, dan choco chip', 'Aktif')