app/Models/ModalPembayaran.php

    public function getPembayaranLengkap()
    {
        $data = $this->select('
Pembayaran.*,
Pesanan.Total,
Pesanan.StatusPesanan,
Pelanggan.NamaPelanggan
')
            ->join('Pesanan', 'Pesanan.IdPesanan = Pembayaran.IdPesanan')
            ->join('Pelanggan', 'Pelanggan.IdPelanggan = Pesanan.IdPelanggan')
            ->orderBy('Pembayaran.TglBayar', 'DESC')
            ->findAll();


        // =====================================================
        // TAMBAHKAN STATUS PELUNASAN
        // =====================================================
        foreach ($data as &$row) {

            $idPesanan = $row['IdPesanan'];

            // Full Payment terverifikasi
            $fullPayment = $this->where('IdPesanan', $idPesanan)
                ->where('JenisPembayaran', 'Full Payment')
                ->where('StatusPembayaran', 'Terverifikasi')
                ->first();

            // Pelunasan terverifikasi
            $pelunasan = $this->where('IdPesanan', $idPesanan)
                ->where('JenisPembayaran', 'Pelunasan')
                ->where('StatusPembayaran', 'Terverifikasi')
                ->first();
---
SELECT `Pembayaran`.*, `Pesanan`.`Total`, `Pesanan`.`StatusPesanan`, `Pelanggan`.`NamaPelanggan`
FROM `Pembayaran`
JOIN `Pesanan` ON `Pesanan`.`IdPesanan` = `Pembayaran`.`IdPesanan`
JOIN `Pelanggan` ON `Pelanggan`.`IdPelanggan` = `Pesanan`.`IdPelanggan`
ORDER BY `Pembayaran`.`TglBayar` DESC
SELECT *
FROM `Pembayaran`
WHERE `IdPesanan` = 'PSN000006'
AND `JenisPembayaran` = 'Full Payment'
AND `StatusPembayaran` = 'Terverifikasi'
 LIMIT 1
SELECT *
FROM `Pembayaran`
WHERE `IdPesanan` = 'PSN000006'
AND `JenisPembayaran` = 'Pelunasan'
AND `StatusPembayaran` = 'Terverifikasi'
 LIMIT 1

    public function getTotalTerverifikasi($IdPesanan)
    {
        $result = $this->selectSum('JumlahBayar')
            ->where('IdPesanan', $IdPesanan)
            ->where('StatusPembayaran', 'Terverifikasi')
            ->get()
            ->getRowArray();
---
SELECT SUM(`JumlahBayar`) AS `JumlahBayar`
FROM `Pembayaran`
WHERE `IdPesanan` = 'PSN000006'
AND `StatusPembayaran` = 'Terverifikasi'