app/Models/ModalPesanan.php

SELECT `Pesanan`.*, `Pelanggan`.`NamaPelanggan`
FROM `Pesanan`
JOIN `Pelanggan` ON `Pelanggan`.`IdPelanggan` = `Pesanan`.`IdPelanggan`
ORDER BY `TglPesanan` DESC
---
    public function getPesananWithPelanggan()
    {
        return $this->select('Pesanan.*, Pelanggan.NamaPelanggan')
            ->join('Pelanggan', 'Pelanggan.IdPelanggan = Pesanan.IdPelanggan')
            ->orderBy('TglPesanan', 'DESC')
            ->findAll();