app/Models/ModalKemasan.php

    public function getKatalog()
    {
        return $this->db->table('Kemasan')
            ->select('
            Kemasan.*,
            Produk.NamaProduk,
            Produk.Deskripsi
        ')
            ->join('Produk', 'Produk.IdProduk = Kemasan.IdProduk')
            ->where('Produk.StatusProduk', 'Aktif')
            ->where('Kemasan.StatusKemasan', 'Aktif')
            ->orderBy('Produk.NamaProduk', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `Kemasan`.*, `Produk`.`NamaProduk`, `Produk`.`Deskripsi`
FROM `Kemasan`
JOIN `Produk` ON `Produk`.`IdProduk` = `Kemasan`.`IdProduk`
WHERE `Produk`.`StatusProduk` = 'Aktif'
AND `Kemasan`.`StatusKemasan` = 'Aktif'
ORDER BY `Produk`.`NamaProduk` ASC