app/Models/ModalPesanan.php

    public function getRiwayatPesanan($IdPelanggan, $status = 'Semua')
    {
        $builder = $this->db->table('Pesanan')
            ->where('IdPelanggan', $IdPelanggan);

        if ($status != 'Semua') {
            $builder->where('StatusPesanan', $status);
        }

        return $builder
            ->orderBy('TglPesanan', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `Pesanan`
WHERE `IdPelanggan` = 'PLG000001'
ORDER BY `TglPesanan` DESC

    public function getDetailPesanan($IdPesanan)
    {
        return $this->db->table('DetailPesanan')
            ->select('
            DetailPesanan.*,
            Produk.NamaProduk,
            Produk.Deskripsi,
            Kemasan.NamaKemasan,
            Kemasan.Berat,
            Kemasan.SatuanBerat,
            Kemasan.Foto
        ')
            ->join('Kemasan', 'Kemasan.IdKemasan = DetailPesanan.IdKemasan')
            ->join('Produk', 'Produk.IdProduk = Kemasan.IdProduk')
            ->where('IdPesanan', $IdPesanan)
            ->get()
            ->getResultArray();
---
SELECT `DetailPesanan`.*, `Produk`.`NamaProduk`, `Produk`.`Deskripsi`, `Kemasan`.`NamaKemasan`, `Kemasan`.`Berat`, `Kemasan`.`SatuanBerat`, `Kemasan`.`Foto`
FROM `DetailPesanan`
JOIN `Kemasan` ON `Kemasan`.`IdKemasan` = `DetailPesanan`.`IdKemasan`
JOIN `Produk` ON `Produk`.`IdProduk` = `Kemasan`.`IdProduk`
WHERE `IdPesanan` = 'PSN000005'

    public function getPembayaranTerakhir($IdPesanan)
    {
        return $this->db->table('Pembayaran')
            ->where('IdPesanan', $IdPesanan)
            ->orderBy('IdPembayaran', 'DESC')
            ->get()
            ->getRowArray();
---
SELECT *
FROM `Pembayaran`
WHERE `IdPesanan` = 'PSN000005'
ORDER BY `IdPembayaran` DESC

    public function getPesanan($IdPesanan)
    {
        return $this->db->table('Pesanan')
            ->join('Pelanggan', 'Pelanggan.IdPelanggan=Pesanan.IdPelanggan')
            ->where('IdPesanan', $IdPesanan)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `Pesanan`
JOIN `Pelanggan` ON `Pelanggan`.`IdPelanggan`=`Pesanan`.`IdPelanggan`
WHERE `IdPesanan` = 'PSN000006'

    public function getPembayaranByPesanan($idPesanan)
    {
        return $this->db->table('Pembayaran')
            ->where('IdPesanan', $idPesanan)
            ->orderBy('IdPembayaran', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `Pembayaran`
WHERE `IdPesanan` = 'PSN000006'
ORDER BY `IdPembayaran` ASC