app/Models/ModalProduk.php

SELECT *
FROM `Produk`
WHERE `StatusProduk` = 'Aktif'
ORDER BY `NamaProduk` ASC
---
    public function getKategori()
{
    return $this->table('Produk')
        ->where('StatusProduk', 'Aktif')
        ->orderBy('NamaProduk', 'ASC')
        ->findAll();