app/Models/ModalUser.php

    public function ceklogin($login)
    {
        return $this->db->table('USER')
            ->groupStart()
            ->where('Username', $login)
            ->orWhere('Email', $login)
            ->groupEnd()
            ->get()
            ->getRowArray();
---
SELECT *
FROM `USER`
WHERE   (
`Username` = 'olla'
OR `Email` = 'olla'
 )