app/Models/ModalPembayaran.php

    public function getPembayaranLengkap()
    {
        $data = $this->select('
Pembayaran.*,
Pesanan.Total,
Pesanan.StatusPesanan,
Pelanggan.NamaPelanggan
')
            ->join('Pesanan', 'Pesanan.IdPesanan = Pembayaran.IdPesanan')
            ->join('Pelanggan', 'Pelanggan.IdPelanggan = Pesanan.IdPelanggan')
            ->orderBy('Pembayaran.IdPembayaran  ', 'DESC')
            ->findAll();
---
SELECT `Pembayaran`.*, `Pesanan`.`Total`, `Pesanan`.`StatusPesanan`, `Pelanggan`.`NamaPelanggan`
FROM `Pembayaran`
JOIN `Pesanan` ON `Pesanan`.`IdPesanan` = `Pembayaran`.`IdPesanan`
JOIN `Pelanggan` ON `Pelanggan`.`IdPelanggan` = `Pesanan`.`IdPelanggan`
ORDER BY `Pembayaran`.`IdPembayaran` DESC